
% https://kr.mathworks.com/help/matlab/getting-started-with-matlab.html?s_tid=CRUX_lftnav
% 위 url 들어가서 튜토리얼에 있는

% 데스크탑 기본사항
% 행렬과 배열
% 배열인덱싱
% 작업공간변수 

% 이렇게 네개 보고 메트랩 명령창에 쳐보면서 익혀둬라
% 복소수 허수 이런것도 있는데 그런건 볼필요 없을듯
% 그리고 이해 했으면 아래 문제 풀도록 하기


%%%%%%%%%%%  2020 - 01 - 21  %%%%%%%%%%%


% 다음 a와 b를 복사해서 명령창에 복사 붙여넣기
a=1:3
b=4:6


% 명령창에 숫자 쓰지 말고 결과 값 아래와 같이 나오도록 하기

ans =

    32




%%%%%%%%%%%  2020 - 01 - 22  %%%%%%%%%%%

% 인터넷 잘 찾아보고 함수 개념 익히기

% 함수에 거리와 시간을 입력하면 속도가 나오는 함수 생성, 함수명은 vel
% vel(거리, 시간)


%%%%%%%%%%%  2020 - 01 - 22  %%%%%%%%%%%

% a=1:5:5000 위 출력값을 for문을 이용하여 동일하게 구현해놓을것


%%%%%%%%%%%  2020 - 01 - 29  %%%%%%%%%%%

% 3개의 2차원 좌표가 있다.
a=[1,0]
b=[0,0]
c=[1,1]


% 내적 각 abc를 구하는 스크립트를 만들고 45도가 나와야 한다
% 인터넷에 내적각 구하는 방법 널려있음
% 매트랩에 내적 함수 있음
% 내적각, 내적 두개 개념 다른거니까 확인해서 가지고 올것
% 30일날 확인이 가능

